src/DataProcessors/гф_КорректировкаНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>гф_КорректировкаНазначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоПроверкаПТУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПроверкаПТУ</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляОтображения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеКороба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гф_СостянияКоробов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыОперацийКорректировкиНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОперацийКорректировкиНазначения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СнятьРезерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СнятьРезервПоМногимНазначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьИКорректировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизвольнаяКорректировкаНазначений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КорректировкаНазначенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаНазначенияТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКорректировкиНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИсходноеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НовоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>гф_IDкороба</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УпаковочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УпаковочныйЛист</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладУпаковки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Поставка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Заказ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Комплектация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Агрегация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПриобретениеТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>гф_ПродукцияВКоробах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/гф_КорректировкаНазначений/Ext/ObjectModule.bsl
#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	РегистрационныеДанные.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	РегистрационныеДанные.Вставить("Наименование", "Корректировка назначений");
	РегистрационныеДанные.Вставить("Версия", Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd"));
	РегистрационныеДанные.Вставить("Информация", "");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	
	// Добавим команду в таблицу
	Если РегистрационныеДанные.Свойство("Команды") Тогда 
		
		ДобавитьКоманду(
			РегистрационныеДанные.Команды, 
			"Корректировка назначений", 
			"гф_КорректировкаНазначений", 
			ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы()
		);
			
		ДобавитьКоманду(
			РегистрационныеДанные.Команды, 
			"Корректировка назначений (автоматически)", 
			"гф_КорректировкаНазначенийАвтоматически", 
			ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода(), 
			Истина
		);
				
	Иначе
		ВызватьИсключение НСтр("ru = 'Не соответствующая версия БСП.'");
	КонецЕсли;
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Добавляет команду в таблицу команд по переданному описанию.
// 
// Параметры:
//   ТаблицаКоманд - ТаблицаЗначений - состав полей см. в функции ПолучитьТаблицуКоманд
//   Представление - Строка - описание печатной формы для пользователя
//   Идентификатор - Строка - идентификатор макета
//   Использование - Строка - параметр вызова обработки
//     Возможные варианты:
//       ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
//       ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
//       ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
//   ПоказыватьОповещение - Булево - указывает, необходимо ли показывать оповещение при начале и завершению работы обработки
//     Не имеет смысла при открытии формы
//   Модификатор - Строка - для печатной формы должен содержать строку ПечатьMXL
//
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "гф_КорректировкаНазначенийАвтоматически" Тогда 
				
		//ЗаписьЖурналаРегистрации(
		//	НСтр("ru = ''"),
		//	УровеньЖурналаРегистрации.Информация,,, "Начало автоматического выполнения.");
			
		ДатаОкончания = ТекущаяДатаСеанса();
		ДатаНачала = ДатаОкончания - 7*86400; // 7 дней
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	гф_ГлобальныеЗначенияСписок.Значение.гф_Организация КАК Организация,
			|	гф_ГлобальныеЗначенияСписок.Значение КАК Склад
			|ИЗ
			|	ПланВидовХарактеристик.гф_ГлобальныеЗначения.Список КАК гф_ГлобальныеЗначенияСписок
			|ГДЕ
			|	гф_ГлобальныеЗначенияСписок.Ссылка.Ключ = &Ключ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Организация = ВыборкаДетальныеЗаписи.Организация;
			Склад = ВыборкаДетальныеЗаписи.Склад;
			ЗаполнитьНаСервере();
			ВыполнитьОбработкуНаСервере();
		КонецЦикла;
	
		//ЗаписьЖурналаРегистрации(
		//	НСтр("ru = ''"),
		//	УровеньЖурналаРегистрации.Информация,,, "Успешное завершение автоматического выполнения.");
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОбработкуНаСервере() Экспорт
	
	// 1. Создание документа «Корректировка назначения товаров» (для корректной работы с движениями по регистрам)
	
	ЗаказыКОбработке = ДанныеДляОтображения.Выгрузить(Новый Структура("Отметка", Истина), "ЗаказКлиента");
	ЗаказыКОбработке.Свернуть("ЗаказКлиента");
	
	Для Каждого СтрокаЗаказа Из ЗаказыКОбработке Цикл
		
		ДанныеКОбработке = Данные.Выгрузить(Новый Структура("ЗаказКлиента", СтрокаЗаказа.ЗаказКлиента));
		
		ДокументОбъект = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
		
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
		ДокументОбъект.Организация = Организация;
		НазначениеЗаказа = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(СтрокаЗаказа.ЗаказКлиента);
		ДокументОбъект.Назначение = НазначениеЗаказа;
		
		Для Каждого СтрокаТабличнойЧасти Из ДанныеКОбработке Цикл
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			НоваяСтрока.ИсходноеНазначение = СтрокаТабличнойЧасти.Назначение;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.гф_IDкороба = СтрокаТабличнойЧасти.УпаковочныйЛист;
		КонецЦикла;
		
		Автор = Пользователи.ТекущийПользователь();
		Ответственный = Пользователи.ТекущийПользователь();

		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			// Произошла ошибка при проведении документа.
			ШаблонТекстаИсключения = НСтр("ru = 'Невозможно провести документ %1.
		                                  |%3.'");
			
			//ЗаписьЖурналаРегистрации(
			//	НСтр("ru = ''"),
			//	УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон(ШаблонТекстаИсключения, ДокументОбъект.Ссылка, ОписаниеОшибки()));
			Сообщить(СтрШаблон(ШаблонТекстаИсключения, ДокументОбъект.Ссылка, ОписаниеОшибки()));
			Возврат;
		КонецПопытки;
		
		// 2. Корректировка назначений в Упаковочном листе (для корректной работы со складскими ордерами)
		УпаковочныеЛистыКОбработке = ДанныеКОбработке.Скопировать(Новый Структура("ЗаказКлиента", СтрокаЗаказа.ЗаказКлиента));
		УпаковочныеЛистыКОбработке.Свернуть("УпаковочныйЛист");
		
		Для Каждого СтрокаУпаковочногоЛиста Из УпаковочныеЛистыКОбработке Цикл
			
			ДокументОбъект = СтрокаУпаковочногоЛиста.УпаковочныйЛист.ПолучитьОбъект();
						
			Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект.Товары Цикл
				СтрокаТабличнойЧасти.Назначение = НазначениеЗаказа;
			КонецЦикла;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			Исключение
				// Произошла ошибка при проведении документа.
				ШаблонТекстаИсключения = НСтр("ru = 'Невозможно провести документ %1.
			                                  |%3.'");
				
				//ЗаписьЖурналаРегистрации(
				//	НСтр("ru = ''"),
				//	УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон(ШаблонТекстаИсключения, ДокументОбъект.Ссылка, ОписаниеОшибки()));
				Сообщить(СтрШаблон(ШаблонТекстаИсключения, ДокументОбъект.Ссылка, ОписаниеОшибки()));
			КонецПопытки; 
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаСервере() Экспорт
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Ссылка КАК УпаковочныйЛист,
		|	УпаковочныйЛистТовары.Ссылка.гф_СостояниеКороба КАК СостояниеКороба,
		|	УпаковочныйЛистТовары.Ссылка.гф_Заказ КАК ЗаказКлиента,
		|	УпаковочныйЛистТовары.Назначение КАК Назначение,
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.Серия КАК Серия,
		|	УпаковочныйЛистТовары.Упаковка КАК Упаковка,
		|	УпаковочныйЛистТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	УпаковочныйЛистТовары.Количество КАК Количество
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УпаковочныйЛистТовары.Ссылка.гф_Организация = &Организация
		|	И УпаковочныйЛистТовары.Ссылка.СкладУпаковки = &Склад
		|	И УпаковочныйЛистТовары.Ссылка.Проведен
		|	И НЕ УпаковочныйЛистТовары.Ссылка.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &Поставка = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ УпаковочныйЛистТовары.Ссылка.гф_Поставка = &Поставка
		|		КОНЕЦ
		|	И УпаковочныйЛистТовары.Назначение.Наименование = ""Техническое""
		|	И НЕ УпаковочныйЛистТовары.Ссылка.гф_СостояниеКороба В (&гф_СостояниеКороба)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанные.УпаковочныйЛист КАК УпаковочныйЛист,
		|	втДанные.ЗаказКлиента КАК ЗаказКлиента,
		|	втДанные.Номенклатура КАК Номенклатура,
		|	втДанные.Характеристика КАК Характеристика,
		|	втДанные.Назначение КАК Назначение,
		|	втДанные.Серия КАК Серия,
		|	втДанные.Упаковка КАК Упаковка,
		|	втДанные.КоличествоУпаковок КАК КоличествоУпаковок,
		|	втДанные.Количество КАК Количество
		|ИЗ
		|	втДанные КАК втДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Отметка,
		|	втДанные.УпаковочныйЛист КАК УпаковочныйЛист,
		|	втДанные.СостояниеКороба КАК СостояниеКороба,
		|	втДанные.ЗаказКлиента КАК ЗаказКлиента,
		|	втДанные.Назначение КАК Назначение
		|ИЗ
		|	втДанные КАК втДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	втДанные.УпаковочныйЛист,
		|	втДанные.СостояниеКороба,
		|	втДанные.ЗаказКлиента,
		|	втДанные.Назначение";
	
	Запрос.УстановитьПараметр("ДатаНачала", 		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Склад", 				Склад);
	Запрос.УстановитьПараметр("Поставка", 			Поставка);
	гф_СостояниеКороба = Новый Массив;
	гф_СостояниеКороба.Добавить(Справочники.гф_СостянияКоробов.Сформирован);
	гф_СостояниеКороба.Добавить(Справочники.гф_СостянияКоробов.Реализован);
	гф_СостояниеКороба.Добавить(Справочники.гф_СостянияКоробов.Расформирован);
	Запрос.УстановитьПараметр("гф_СостояниеКороба", гф_СостояниеКороба);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Данные.Загрузить(РезультатЗапроса[1].Выгрузить());
	ДанныеДляОтображения.Загрузить(РезультатЗапроса[2].Выгрузить());
	
КонецПроцедуры
